# Most common operations used on Series and Dataframes

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as pp
%matplotlib inline

# Series

In [2]:
colors = ['red', 'green', 'blue', 'orange', 'yellow', 'white', 'black', 'pink', 'orange', 'yellow', 'blue']
numbers = [ 1 , 2, 3, 4, 5, 6, 7, 8, 9, 3, 2, 1, 4, 8, 9]
ser_color = pd.Series( colors )
ser_numbers = pd.Series(numbers)

In [3]:
ser_color

0        red
1      green
2       blue
3     orange
4     yellow
5      white
6      black
7       pink
8     orange
9     yellow
10      blue
dtype: object

In [4]:
ser_numbers

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     3
10    2
11    1
12    4
13    8
14    9
dtype: int64

In [5]:
ser_color.shape

(11,)

In [6]:
ser_color.ndim

1

In [7]:
  ser_color.isnull()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [8]:
type(ser_color.apply(lambda x : x[0]))

pandas.core.series.Series

In [9]:
type(ser_color.transform(lambda x : x[0]))

pandas.core.series.Series

In [10]:
index = ser_color.apply(lambda x: x[0])
ser_color.index = index

In [11]:
ser_color

r       red
g     green
b      blue
o    orange
y    yellow
w     white
b     black
p      pink
o    orange
y    yellow
b      blue
dtype: object

In [12]:
ser_color.reset_index(name='Color') # Note this returns a Dataframe where the index becomes a column

   index   Color
0      r     red
1      g   green
2      b    blue
3      o  orange
4      y  yellow
5      w   white
6      b   black
7      p    pink
8      o  orange
9      y  yellow
10     b    blue

In [13]:
# positional access (numpy style)
ser_color[1:3] #OR ser_color.iloc[1:3]

g    green
b     blue
dtype: object

In [14]:
# index label access
ser_color['r']

'red'

In [15]:
# multiple
ser_color[['r', 'o']]

r       red
o    orange
o    orange
dtype: object

In [16]:
ser_color.head()

r       red
g     green
b      blue
o    orange
y    yellow
dtype: object

In [17]:
ser_color.tail()

b     black
p      pink
o    orange
y    yellow
b      blue
dtype: object

In [18]:
ser_color.take([1,3,6])

g     green
o    orange
b     black
dtype: object

  <i>Series Support broadcast when binary operations with scalar and elementwise with another series</i>

In [3]:
print(ser_numbers)
ser_numbers * 2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     3
10    2
11    1
12    4
13    8
14    9
dtype: int64

0      2
1      4
2      6
3      8
4     10
5     12
6     14
7     16
8     18
9      6
10     4
11     2
12     8
13    16
14    18
dtype: int64

In [20]:
# filter elements using conditions
ser_numbers[ser_numbers > 5]

5     6
6     7
7     8
8     9
13    8
14    9
dtype: int64

In [21]:
#unique elements
ser_color.unique()

array(['red', 'green', 'blue', 'orange', 'yellow', 'white', 'black', 'pink'], dtype=object)

In [22]:
# Group and do aggregate count on each value
ser_color.value_counts()

blue      2
orange    2
yellow    2
pink      1
black     1
white     1
green     1
red       1
dtype: int64

In [23]:
# total elements
ser_color.count()

11

In [24]:
# Drop certain lables
ser_color.drop('y')

r       red
g     green
b      blue
o    orange
w     white
b     black
p      pink
o    orange
b      blue
dtype: object

In [25]:
ser_numbers.describe()

count    15.000000
mean      4.800000
std       2.858571
min       1.000000
25%       2.500000
50%       4.000000
75%       7.500000
max       9.000000
dtype: float64

In [26]:
# fill missing values
pd.Series([1, 2, np.nan, 8]).interpolate()

0    1.0
1    2.0
2    5.0
3    8.0
dtype: float64

In [27]:
ser1 = pd.Series([1, 4, 7, np.nan, 10, np.nan])
ser1.fillna(ser1.mean()) # fill missing values with the mean

0     1.0
1     4.0
2     7.0
3     5.5
4    10.0
5     5.5
dtype: float64

In [28]:
# Aggregate over entire series to give one value
ser_numbers.sum()

72

In [29]:
ser_numbers.max()

9

In [30]:
# Cummulative Aggregation to give another series
ser_numbers.cumsum()

0      1
1      3
2      6
3     10
4     15
5     21
6     28
7     36
8     45
9     48
10    50
11    51
12    55
13    63
14    72
dtype: int64

In [31]:
ser_numbers.cummax()

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     9
10    9
11    9
12    9
13    9
14    9
dtype: int64

In [32]:
#Sorting by value
ser_numbers.sort_values()

0     1
11    1
1     2
10    2
2     3
9     3
3     4
12    4
4     5
5     6
6     7
7     8
13    8
8     9
14    9
dtype: int64

In [33]:
# sort by index
ser_color.sort_index()

b      blue
b     black
b      blue
g     green
o    orange
o    orange
p      pink
r       red
w     white
y    yellow
y    yellow
dtype: object

In [34]:
ser_color.append(pd.Series(['black', 'white'], index=['b','w']))

r       red
g     green
b      blue
o    orange
y    yellow
w     white
b     black
p      pink
o    orange
y    yellow
b      blue
b     black
w     white
dtype: object

In [35]:
''' TIME SERIES'''
# Create a date time index based for a specific period and specific frequency (eq: 5H, 10M etc..)
pd.date_range(start='1/1/2017', end='31/1/2017', freq='D')

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10', '2017-01-11', '2017-01-12',
               '2017-01-13', '2017-01-14', '2017-01-15', '2017-01-16',
               '2017-01-17', '2017-01-18', '2017-01-19', '2017-01-20',
               '2017-01-21', '2017-01-22', '2017-01-23', '2017-01-24',
               '2017-01-25', '2017-01-26', '2017-01-27', '2017-01-28',
               '2017-01-29', '2017-01-30', '2017-01-31'],
              dtype='datetime64[ns]', freq='D')

In [36]:
# Create fixed number of samples based on start, frequency
pd.date_range(start=pd.datetime.now(), periods=10, freq='H')

DatetimeIndex(['2017-08-25 20:51:09.607826', '2017-08-25 21:51:09.607826',
               '2017-08-25 22:51:09.607826', '2017-08-25 23:51:09.607826',
               '2017-08-26 00:51:09.607826', '2017-08-26 01:51:09.607826',
               '2017-08-26 02:51:09.607826', '2017-08-26 03:51:09.607826',
               '2017-08-26 04:51:09.607826', '2017-08-26 05:51:09.607826'],
              dtype='datetime64[ns]', freq='H')

In [37]:
ser_numbers.count()

15

In [38]:
time_index = pd.date_range(start=pd.datetime.now(), periods=ser_numbers.count(), freq='D')

In [39]:
ser_numbers.index = time_index
ser_numbers

2017-08-25 20:51:09.647932    1
2017-08-26 20:51:09.647932    2
2017-08-27 20:51:09.647932    3
2017-08-28 20:51:09.647932    4
2017-08-29 20:51:09.647932    5
2017-08-30 20:51:09.647932    6
2017-08-31 20:51:09.647932    7
2017-09-01 20:51:09.647932    8
2017-09-02 20:51:09.647932    9
2017-09-03 20:51:09.647932    3
2017-09-04 20:51:09.647932    2
2017-09-05 20:51:09.647932    1
2017-09-06 20:51:09.647932    4
2017-09-07 20:51:09.647932    8
2017-09-08 20:51:09.647932    9
Freq: D, dtype: int64

# DataFrame

In [4]:
# use an existing datasets
import seaborn as sns

In [5]:
football = pd.read_csv('football.csv')
tips = sns.load_dataset('tips')

In [42]:
football

    game_id    year     team  wins  losses
0     100.0  2010.0    Bears  11.0     5.0
1       NaN  2010.0  Rockets  13.0     6.0
2     114.0  2011.0    Bears   8.0     8.0
3     145.0  2012.0   NODATA   9.0     3.0
4     128.0  2012.0    Bears  10.0     6.0
5     167.0     NaN  Rockets  12.0     3.0
6     142.0  2011.0  Packers  15.0     1.0
7     187.0  2012.0  Rockets  13.0     NaN
8     157.0  2012.0  Packers  11.0     5.0
9     187.0  2010.0  Packers   NaN     5.0
10    171.0  2010.0    Lions   6.0    10.0
11    185.0  2011.0    Lions  10.0     6.0
12    200.0  2012.0    Lions   4.0    12.0

In [43]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
# Setting index
football = football.set_index('game_id') # have to put inplace otherwise
football.head()

           year     team  wins  losses
game_id
 100.0   2010.0    Bears  11.0     5.0
NaN      2010.0  Rockets  13.0     6.0
 114.0   2011.0    Bears   8.0     8.0
 145.0   2012.0   NODATA   9.0     3.0
 128.0   2012.0    Bears  10.0     6.0

In [45]:
# row labels
football.index

Float64Index([100.0,   nan, 114.0, 145.0, 128.0, 167.0, 142.0, 187.0, 157.0,
              187.0, 171.0, 185.0, 200.0],
             dtype='float64', name='game_id')

In [46]:
# Column labels
football.columns

Index(['year', 'team', 'wins', 'losses'], dtype='object')

In [47]:
football.shape

(13, 4)

In [48]:
football.ndim

2

In [49]:
football.size

52

In [50]:
football.isnull()

          year   team   wins  losses
game_id
 100.0   False  False  False   False
NaN      False  False  False   False
 114.0   False  False  False   False
 145.0   False  False  False   False
 128.0   False  False  False   False
 167.0    True  False  False   False
 142.0   False  False  False   False
 187.0   False  False  False    True
 157.0   False  False  False   False
 187.0   False  False   True   False
 171.0   False  False  False   False
 185.0   False  False  False   False
 200.0   False  False  False   False

In [51]:
# Dataframes support broadcast with scalars and with other dataframes (element wise ) 
# but columns must be numeric for math ops
tips[['tip', 'total_bill']][:5] * 2

    tip  total_bill
0  2.02       33.98
1  3.32       20.68
2  7.00       42.02
3  6.62       47.36
4  7.22       49.18

In [52]:
# NOTE: some operations only apply to numeric columns
tips.mean()

total_bill    19.785943
tip            2.998279
size           2.569672
dtype: float64

In [53]:
# NOTE: the sum applies to even string columns (in which case it concatanates it)
# NOTE: Also the nan values are ignored for numeric columns when calculating. 
# index is not considered for the operation
football.sum()

year                                                  24133
team      BearsRocketsBearsNODATABearsRocketsPackersRock...
wins                                                    122
losses                                                   70
dtype: object

In [54]:
football.median() # Note the 'team' column is ignored here.

year      2011.0
wins        10.5
losses       5.5
dtype: float64

In [55]:
football.max()

year         2012
team      Rockets
wins           15
losses         12
dtype: object

In [56]:
football.cummax()

         year     team wins losses
game_id
 100.0   2010    Bears   11      5
NaN      2010  Rockets   13      6
 114.0   2011  Rockets   13      8
 145.0   2012  Rockets   13      8
 128.0   2012  Rockets   13      8
 167.0    NaN  Rockets   13      8
 142.0   2012  Rockets   15      8
 187.0   2012  Rockets   15    NaN
 157.0   2012  Rockets   15      8
 187.0   2012  Rockets  NaN      8
 171.0   2012  Rockets   15     10
 185.0   2012  Rockets   15     10
 200.0   2012  Rockets   15     12

In [57]:
# Note the nan values are ignored for numeric cols
football.count()

year      12
team      13
wins      12
losses    12
dtype: int64

In [58]:
# get index from column name
football.columns.get_loc('team')

1

In [59]:
# take
football.take([0,1,3])

           year     team  wins  losses
game_id
 100.0   2010.0    Bears  11.0     5.0
NaN      2010.0  Rockets  13.0     6.0
 145.0   2012.0   NODATA   9.0     3.0

In [3]:
students = pd.read_csv('students.csv')
#print(students)
students[:5] # Take first 5 rows . This syntax can only be used to access rows and ALL COLUMNS 
#(we cannot access only certain columns)

  student_id  gender  grade  math  science  english
0   student1    Male      4    77       77       75
1   student2  Female      6    87       84       78
2   student3  Female      4    86       75       68
3   student4    Male      4    69       69       74
4   student5  Female      5    73       69       70

In [11]:
# we can also use the above syntax to access all rows and certain columns
students[['student_id', 'grade', 'gender']] # we can also change the order of the columns returned

   student_id  grade  gender
0    student1      4    Male
1    student2      6  Female
2    student3      4  Female
3    student4      4    Male
4    student5      5  Female
5    student6      6    Male
6    student7      5    Male
7    student8      5  Female
8    student9      5  Female
9   student10      5    Male
10  student11      5    Male
11  student12      4  Female
12  student13      6  Female
13  student14      5  Female
14  student15      5    Male
15  student16      5  Female
16  student17      5    Male
17  student18      6    Male

In [4]:
students.loc[:5] # take upto the index 5 (inclusive)

  student_id  gender  grade  math  science  english
0   student1    Male      4    77       77       75
1   student2  Female      6    87       84       78
2   student3  Female      4    86       75       68
3   student4    Male      4    69       69       74
4   student5  Female      5    73       69       70
5   student6    Male      6    80       78       73

In [13]:
# To access certain columns we have to use loc
#students[:5, ['student_id', 'grade']] This wont work

students.loc[:5, ['student_id', 'grade', 'gender']] # upto and including index 5 and only the columns specified.
# Note order is different than the orignal dataframe and matches the order we specified above.

  student_id  grade  gender
0   student1      4    Male
1   student2      6  Female
2   student3      4  Female
3   student4      4    Male
4   student5      5  Female
5   student6      6    Male

In [7]:
# We can access Pandas data frame as numpy matrix using pure indexes instead of labels (names).
students.iloc[:5] # gets first five rows

  student_id  gender  grade  math  science  english
0   student1    Male      4    77       77       75
1   student2  Female      6    87       84       78
2   student3  Female      4    86       75       68
3   student4    Male      4    69       69       74
4   student5  Female      5    73       69       70

In [8]:
students.iloc[:5, [1,2]] # Access first 5 rows and only columns indexed 1,2

   gender  grade
0    Male      4
1  Female      6
2  Female      4
3    Male      4
4  Female      5

In [9]:
students.iloc[:5, 1:3] # columns 1 to 3(exclusive)

   gender  grade
0    Male      4
1  Female      6
2  Female      4
3    Male      4
4  Female      5

In [60]:
# applying custom function . Along a particular axis
football.apply(lambda x : x * 2)

           year            team  wins  losses
game_id
 100.0   4020.0      BearsBears  22.0    10.0
NaN      4020.0  RocketsRockets  26.0    12.0
 114.0   4022.0      BearsBears  16.0    16.0
 145.0   4024.0    NODATANODATA  18.0     6.0
 128.0   4024.0      BearsBears  20.0    12.0
 167.0      NaN  RocketsRockets  24.0     6.0
 142.0   4022.0  PackersPackers  30.0     2.0
 187.0   4024.0  RocketsRockets  26.0     NaN
 157.0   4024.0  PackersPackers  22.0    10.0
 187.0   4020.0  PackersPackers   NaN    10.0
 171.0   4020.0      LionsLions  12.0    20.0
 185.0   4022.0      LionsLions  20.0    12.0
 200.0   4024.0      LionsLions   8.0    24.0

In [61]:
# on select columns
football.loc[:, ['wins', 'losses']].apply(lambda x : x * 2)

         wins  losses
game_id
 100.0   22.0    10.0
NaN      26.0    12.0
 114.0   16.0    16.0
 145.0   18.0     6.0
 128.0   20.0    12.0
 167.0   24.0     6.0
 142.0   30.0     2.0
 187.0   26.0     NaN
 157.0   22.0    10.0
 187.0    NaN    10.0
 171.0   12.0    20.0
 185.0   20.0    12.0
 200.0    8.0    24.0

In [62]:
# applies a function element wise
tips.iloc[:5, :2].applymap(lambda x : x * 2)

   total_bill   tip
0       33.98  2.02
1       20.68  3.32
2       42.02  7.00
3       47.36  6.62
4       49.18  7.22

In [63]:
# This notation is only used for getting certain rows. 
#For getting specific rows and columns use loc[:5, [list of columns]] OR .iloc[:5, 1:3] (numpy style) 
tips[:5]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [64]:
# Common statistics for numeric columns
football.describe()

              year       wins     losses
count    12.000000  12.000000  12.000000
mean   2011.083333  10.166667   5.833333
std       0.900337   3.099365   3.040136
min    2010.000000   4.000000   1.000000
25%    2010.000000   8.750000   4.500000
50%    2011.000000  10.500000   5.500000
75%    2012.000000  12.250000   6.500000
max    2012.000000  15.000000  12.000000

In [65]:
# information of column labels and types. Useful for dataframes with large number of columns
football.info()

<class 'pandas.core.frame.DataFrame'>
Float64Index: 13 entries, 100.0 to 200.0
Data columns (total 4 columns):
year      12 non-null float64
team      13 non-null object
wins      12 non-null float64
losses    12 non-null float64
dtypes: float64(3), object(1)
memory usage: 520.0+ bytes

In [66]:
# Sorting

football.sort_values('wins',ascending=False).head(5) # top 5 wins

           year     team  wins  losses
game_id
 142.0   2011.0  Packers  15.0     1.0
NaN      2010.0  Rockets  13.0     6.0
 187.0   2012.0  Rockets  13.0     NaN
 167.0      NaN  Rockets  12.0     3.0
 100.0   2010.0    Bears  11.0     5.0

In [67]:
tips.iloc[:5,:]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [68]:
# Creating pivot table
# NOTE the column specified as index must have unique values
# This will not do any aggregation but instead just layout the column and index in a matrix form with corresponding
# value if exists in the cell.
tips.iloc[:5,:].pivot( index='total_bill', columns='tip', values='sex')

tip           1.01  1.66  3.31  3.50    3.61
total_bill
10.34          NaN  Male   NaN   NaN     NaN
16.99       Female   NaN   NaN   NaN     NaN
21.01          NaN   NaN   NaN  Male     NaN
23.68          NaN   NaN  Male   NaN     NaN
24.59          NaN   NaN   NaN   NaN  Female

In [69]:
# Creates a pivot table by aggregating values (according to specified function) 
# for each unique combination of index and column
pd.pivot_table(data=tips,  index='sex', columns='smoker', values='tip', aggfunc=np.median)

smoker   Yes    No
sex
Male    3.00  2.74
Female  2.88  2.68

In [3]:
'''Adding new column based on some operation on existing columns '''
students = pd.read_csv('students.csv')

In [4]:
students.head()

  student_id  gender  grade  math  science  english
0   student1    Male      4    77       77       75
1   student2  Female      6    87       84       78
2   student3  Female      4    86       75       68
3   student4    Male      4    69       69       74
4   student5  Female      5    73       69       70

In [5]:
overall_score = students[['math','science','english']].mean(axis = 1) # Note axis =1 means do the mean for each row

In [6]:
students['overall_score'] = overall_score.astype(np.int32)
students.head()

  student_id  gender  grade  math  science  english  overall_score
0   student1    Male      4    77       77       75             76
1   student2  Female      6    87       84       78             83
2   student3  Female      4    86       75       68             76
3   student4    Male      4    69       69       74             70
4   student5  Female      5    73       69       70             70

In [7]:
def transform_score(x):
    if(x > 80):
        return 'exellent'
    elif(x>70 and x <=80):
        return 'good'
    else:
        return 'average'

students['rating'] = students['overall_score'].apply(transform_score)
students.head()

  student_id  gender  grade  math  science  english  overall_score    rating
0   student1    Male      4    77       77       75             76      good
1   student2  Female      6    87       84       78             83  exellent
2   student3  Female      4    86       75       68             76      good
3   student4    Male      4    69       69       74             70   average
4   student5  Female      5    73       69       70             70   average

In [10]:
# melt - to collapse multiple columns from a wide format to long format
students.melt(id_vars='student_id', value_vars=['math', 'science', 'english'], var_name='score_type', value_name='score').head(30)

   student_id score_type  score
0    student1       math     77
1    student2       math     87
2    student3       math     86
3    student4       math     69
4    student5       math     73
5    student6       math     80
6    student7       math     73
7    student8       math     88
8    student9       math     77
9   student10       math     82
10  student11       math     71
11  student12       math     87
12  student13       math     78
13  student14       math     82
14  student15       math     77
15  student16       math     79
16  student17       math     70
17  student18       math     70
18   student1    science     77
19   student2    science     84
20   student3    science     75
21   student4    science     69
22   student5    science     69
23   student6    science     78
24   student7    science     87
25   student8    science     86
26   student9    science     72
27  student10    science     75
28  student11    science     88
29  student12    science     69

In [11]:
students['grade'].value_counts() # group and give count of unique values in the specified column

5    10
6     4
4     4
Name: grade, dtype: int64

In [12]:
students['grade'].unique() # get unique values from a column

array([4, 6, 5], dtype=int64)

<h4>Basically when we select a single column of a dataframe, it returns a Series hence all operations of a series apply to it. </h4>

In [9]:
''' TIME SERIES'''
occupancy = pd.read_csv('../datasets/occupancy_data/datatest.txt')
occupancy.head()

,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
140,2015-02-02 14:19:00,23.7000,26.272,585.200000,749.200000,0.004764,1
141,2015-02-02 14:19:59,23.7180,26.290,578.400000,760.400000,0.004773,1
142,2015-02-02 14:21:00,23.7300,26.230,572.666667,769.666667,0.004765,1
143,2015-02-02 14:22:00,23.7225,26.125,493.750000,774.750000,0.004744,1
144,2015-02-02 14:23:00,23.7540,26.200,488.600000,779.000000,0.004767,1

In [10]:
occupancy['date'] = pd.to_datetime(occupancy['date'], format='%Y-%m-%d %H:%M:%S') # convert to date column to date time
occupancy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2665 entries, 140 to 2804
Data columns (total 7 columns):
date             2665 non-null datetime64[ns]
Temperature      2665 non-null float64
Humidity         2665 non-null float64
Light            2665 non-null float64
CO2              2665 non-null float64
HumidityRatio    2665 non-null float64
Occupancy        2665 non-null int64
dtypes: datetime64[ns](1), float64(5), int64(1)
memory usage: 166.6 KB

In [11]:
# Set the 'date' column as index
occupancy = occupancy.set_index('date', drop = True)
occupancy.head()

,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
date,,,,,,
2015-02-02 14:19:00,23.7000,26.272,585.200000,749.200000,0.004764,1
2015-02-02 14:19:59,23.7180,26.290,578.400000,760.400000,0.004773,1
2015-02-02 14:21:00,23.7300,26.230,572.666667,769.666667,0.004765,1
2015-02-02 14:22:00,23.7225,26.125,493.750000,774.750000,0.004744,1
2015-02-02 14:23:00,23.7540,26.200,488.600000,779.000000,0.004767,1

In [12]:
# for simplicity we take only one day data
occupancy = occupancy.loc['2015-02-02 00:00:00': '2015-02-02 23:59:59']
occupancy.count()

Temperature      581
Humidity         581
Light            581
CO2              581
HumidityRatio    581
Occupancy        581
dtype: int64

<b>using time series functionality, we can get the day of the month, or weekday etc... for each row</b>

In [31]:
occupancy.index.day[:5]

Int64Index([2, 2, 2, 2, 2], dtype='int64', name='date')

In [32]:
occupancy.index.weekday[:5] # 0 - Monday

Int64Index([0, 0, 0, 0, 0], dtype='int64', name='date')

In [33]:
# we can resample the data at hourly instead of every minute and take mean of temp,humidity etc..
occupancy.resample('H')

DatetimeIndexResampler [freq=<Hour>, axis=0, closed=left, label=left, convention=start, base=0]

In [48]:
occupancy_hourly_resampled = occupancy.resample('H').mean()
occupancy_hourly_resampled.head()

,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
date,,,,,,
2015-02-02 14:00:00,23.657118,27.023720,499.978107,898.784843,0.004889,1.000000
2015-02-02 15:00:00,23.293950,28.412430,456.719048,1103.186310,0.005030,1.000000
2015-02-02 16:00:00,22.773142,26.737452,434.838993,979.566003,0.004585,1.000000
2015-02-02 17:00:00,22.534520,24.972128,426.736158,822.562853,0.004217,0.610169
2015-02-02 18:00:00,21.993372,24.595967,32.984167,720.400278,0.004018,0.083333

In [13]:
# this is same as before except the to_period changes the date to hh:mm from hh:mm:ss
occupancy_hourly_resampled = occupancy.resample('H').mean().to_period(freq='H')
occupancy_hourly_resampled.head()

,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
date,,,,,,
2015-02-02 14:00,23.657118,27.023720,499.978107,898.784843,0.004889,1.000000
2015-02-02 15:00,23.293950,28.412430,456.719048,1103.186310,0.005030,1.000000
2015-02-02 16:00,22.773142,26.737452,434.838993,979.566003,0.004585,1.000000
2015-02-02 17:00,22.534520,24.972128,426.736158,822.562853,0.004217,0.610169
2015-02-02 18:00,21.993372,24.595967,32.984167,720.400278,0.004018,0.083333

In [53]:
# converting the time series index to period index 
occupancy_hourly_toperiod = occupancy.to_period(freq='H')
occupancy_hourly_toperiod.head()

,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
date,,,,,,
2015-02-02 14:00,23.7000,26.272,585.200000,749.200000,0.004764,1
2015-02-02 14:00,23.7180,26.290,578.400000,760.400000,0.004773,1
2015-02-02 14:00,23.7300,26.230,572.666667,769.666667,0.004765,1
2015-02-02 14:00,23.7225,26.125,493.750000,774.750000,0.004744,1
2015-02-02 14:00,23.7540,26.200,488.600000,779.000000,0.004767,1

In [ ]:
# NOTE : to Period merely changes the frequency (rounds to the nearest hour) and keeps the individual rows intact
occupancy_hourly_toperiod.count()

In [54]:
#NOTE: Resample actually groups the rows together by the frequency (hourly in this case) and performs the aggregation
# function that we specified (mean in this case)
occupancy_hourly_resampled.count()

Temperature      10
Humidity         10
Light            10
CO2              10
HumidityRatio    10
Occupancy        10
dtype: int64

In [26]:
''' Doing the same thing as above without DatetimeIndex instead a column of type datetime'''
occupancy = pd.read_csv('../datasets/occupancy_data/datatest.txt')
occupancy.head()

,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
140,2015-02-02 14:19:00,23.7000,26.272,585.200000,749.200000,0.004764,1
141,2015-02-02 14:19:59,23.7180,26.290,578.400000,760.400000,0.004773,1
142,2015-02-02 14:21:00,23.7300,26.230,572.666667,769.666667,0.004765,1
143,2015-02-02 14:22:00,23.7225,26.125,493.750000,774.750000,0.004744,1
144,2015-02-02 14:23:00,23.7540,26.200,488.600000,779.000000,0.004767,1

In [27]:
occupancy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2665 entries, 140 to 2804
Data columns (total 7 columns):
date             2665 non-null object
Temperature      2665 non-null float64
Humidity         2665 non-null float64
Light            2665 non-null float64
CO2              2665 non-null float64
HumidityRatio    2665 non-null float64
Occupancy        2665 non-null int64
dtypes: float64(5), int64(1), object(1)
memory usage: 166.6+ KB

In [29]:
occupancy['date'] = pd.to_datetime(occupancy['date'])
occupancy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2665 entries, 140 to 2804
Data columns (total 7 columns):
date             2665 non-null datetime64[ns]
Temperature      2665 non-null float64
Humidity         2665 non-null float64
Light            2665 non-null float64
CO2              2665 non-null float64
HumidityRatio    2665 non-null float64
Occupancy        2665 non-null int64
dtypes: datetime64[ns](1), float64(5), int64(1)
memory usage: 166.6 KB

In [20]:
# take data for a day
occupancy = occupancy[ (occupancy['date'] >='2015-02-02 00:00:00') & ( occupancy['date'] <= '2015-02-02 23:59:59' )]
occupancy.count()

date             581
Temperature      581
Humidity         581
Light            581
CO2              581
HumidityRatio    581
Occupancy        581
dtype: int64

In [30]:
occupancy.resample('H', on='date').mean().to_period(freq='H').head(10)

,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
date,,,,,,
2015-02-02 14:00,23.657118,27.023720,499.978107,898.784843,0.004889,1.000000
2015-02-02 15:00,23.293950,28.412430,456.719048,1103.186310,0.005030,1.000000
2015-02-02 16:00,22.773142,26.737452,434.838993,979.566003,0.004585,1.000000
2015-02-02 17:00,22.534520,24.972128,426.736158,822.562853,0.004217,0.610169
2015-02-02 18:00,21.993372,24.595967,32.984167,720.400278,0.004018,0.083333
2015-02-02 19:00,21.276331,23.840943,0.000000,584.944262,0.003725,0.000000
2015-02-02 20:00,21.005339,23.302025,0.000000,513.755650,0.003580,0.000000
2015-02-02 21:00,20.881794,22.866686,0.000000,480.285278,0.003486,0.000000
2015-02-02 22:00,20.736664,22.501680,0.000000,461.391803,0.003399,0.000000
2015-02-02 23:00,20.671794,22.278593,0.000000,451.983616,0.003352,0.000000